


回溯法属于深度优先搜索，由于是全局搜索，复杂度相对高。
https://zhuanlan.zhihu.com/p/54275352

白话算法

回溯法（back tracking）（探索与回溯法）是一种选优搜索法，又称为试探法，按选优条件向前搜索，以达到目标。但当探索到某一步时，发现原先选择并不优或达不到目标，就退回一步重新选择，这种走不通就退回再走的技术为回溯法，而满足回溯条件的某个状态的点称为“回溯点”。

白话：回溯法可以理解为通过选择不同的岔路口寻找目的地，一个岔路口一个岔路口的去尝试找到目的地。如果走错了路，继续返回来找到岔路口的另一条路，直到找到目的地。




--------------------------------------------------------------------------------------------------------------------------------------


完全背包（unbounded knapsack problem）与01背包不同就是每种物品可以有无限多个：一共有N种物品，每种物品有无限多个，第i（i从1开始）种物品的重量为w[i]，价值为v[i]。在总重量不超过背包承载上限W的情况下，能够装入背包的最大价值是多少？





--------------------------------------------------------------------------------------------------------------------------------------

















--------------------------------------------------------------------------------------------------------------------------------------

















--------------------------------------------------------------------------------------------------------------------------------------








