

1. 形成习惯，专注于刷题（无杂念，就是刷）
2. 如果这是唯一取得优胜的办法，那就是 必须不断训练和强化的，像查理一样，专注于练习最难右手挥球，一旦学会，对手将无法取得优势。
3. 如果这是唯一取得优胜的办法，那就专注于训练这个方法，心无杂念。
4. 如果这是取得胜利的唯一路径，那我们就坚决取得胜利。

https://leetcode.cn/u/wa-pian-d/

------------------------------------------------------------------------------------------------------------------------------


数组,字符串,哈希表,动态规划,数学,深度优先搜索,排序,贪心,广度优先搜索,树,二分查找,数据库,矩阵,二叉树,双指针,位运算,栈,设计,堆（优先队列）,图,回溯,模拟,前缀和,链表,计数,滑动窗口,并查集,递归,分治,二叉搜索树,有序集合,单调栈,字典树,枚举,队列,状态压缩,记忆化搜索,几何,拓扑排序,线段树,哈希函数,树状数组,博弈,数据流,字符串匹配,数论,滚动哈希,最短路,组合数学,交互,随机化,归并排序,脑筋急转弯,单调队列,双向链表,快速选择,迭代器,概率与统计,多线程,桶排序,后缀数组,计数排序,最小生成树,扫描线,Shell,水塘抽样,欧拉回路,基数排序,强连通分量,双连通分量,拒绝采样



动态规划,深度优先搜索(dfs),广度优先搜索(bfs),排序,二分查找,双指针,栈,堆（优先队列）,回溯,递归,分治,单调栈,枚举,队列,状态压缩,记忆化搜索,哈希函数,单调队列,快速选择,桶排序,模拟,贪心, 图




------------------------------------------------------------------------------------------------------------------------------






------------------------------------------------------------------------------------------------------------------------------







------------------------------------------------------------------------------------------------------------------------------








------------------------------------------------------------------------------------------------------------------------------








------------------------------------------------------------------------------------------------------------------------------







------------------------------------------------------------------------------------------------------------------------------










